studycell/STM32_AIChess/板子代码/AI_Test_Project/Project/EID-V2-all/src/lcd.c
#include "lcd.h"
#include "stdlib.h"
#include "font.h" 
#include "stm32f10x_spi.h"
#include "stm32f10x_exti.h"
#include <stm32f10x_usart.h>
//////////////////////////////////////////////////////////////////////////////////	 
//±¾³ÌÐòÖ»¹©Ñ§Ï°Ê¹ÓÃ£¬Î´¾­×÷ÕßÐí¿É£¬²»µÃÓÃÓÚÆäËüÈÎºÎÓÃÍ¾
//ALIENTEK MiniSTM32F103¿ª·¢°å
//2.4´ç/2.8´ç/3.5´ç/4.3´ç/7´ç TFTÒº¾§Çý¶¯	  
//Ö§³ÖÇý¶¯ICÐÍºÅ°üÀ¨:ILI9341/ILI9325/RM68042/RM68021/ILI9320/ILI9328/LGDP4531/LGDP4535/
//                  SPFD5408/1505/B505/C505/NT35310/NT35510/SSD1963µÈ		    
//ÕýµãÔ­×Ó@ALIENTEK
//¼¼ÊõÂÛÌ³:www.openedv.com
//´´½¨ÈÕÆÚ:2010/7/4
//°æ±¾£ºV3.0
//°æÈ¨ËùÓÐ£¬µÁ°æ±Ø¾¿¡£
//Copyright(C) ¹ãÖÝÊÐÐÇÒíµç×Ó¿Æ¼¼ÓÐÏÞ¹«Ë¾ 2014-2024
//All rights reserved	
//********************************************************************************
//V1.2ÐÞ¸ÄËµÃ÷
//Ö§³ÖÁËSPFD5408µÄÇý¶¯,ÁíÍâ°ÑÒº¾§IDÖ±½Ó´òÓ¡³ÉHEX¸ñÊ½.·½±ã²é¿´LCDÇý¶¯IC.
//V1.3
//¼ÓÈëÁË¿ìËÙIOµÄÖ§³Ö
//ÐÞ¸ÄÁË±³¹â¿ØÖÆµÄ¼«ÐÔ£¨ÊÊÓÃÓÚV1.8¼°ÒÔºóµÄ¿ª·¢°å°æ±¾£©
//¶ÔÓÚ1.8°æ±¾Ö®Ç°(²»°üÀ¨1.8)µÄÒº¾§Ä£¿é,ÇëÐÞ¸ÄLCD_Initº¯ÊýµÄLCD_LED=1;ÎªLCD_LED=1;
//V1.4
//ÐÞ¸ÄÁËLCD_ShowCharº¯Êý£¬Ê¹ÓÃ»­µã¹¦ÄÜ»­×Ö·û¡£
//¼ÓÈëÁËºáÊúÆÁÏÔÊ¾µÄÖ§³Ö
//V1.5 20110730
//1,ÐÞ¸ÄÁËB505Òº¾§¶ÁÑÕÉ«ÓÐÎóµÄbug.
//2,ÐÞ¸ÄÁË¿ìËÙIO¼°ºáÊúÆÁµÄÉèÖÃ·½Ê½.
//V1.6 20111116
//1,¼ÓÈë¶ÔLGDP4535Òº¾§µÄÇý¶¯Ö§³Ö
//V1.7 20120713
//1,Ôö¼ÓLCD_RD_DATAº¯Êý
//2,Ôö¼Ó¶ÔILI9341µÄÖ§³Ö
//3,Ôö¼ÓILI9325µÄ¶ÀÁ¢Çý¶¯´úÂë
//4,Ôö¼ÓLCD_Scan_Dirº¯Êý(É÷ÖØÊ¹ÓÃ)	  
//6,ÁíÍâÐÞ¸ÄÁË²¿·ÖÔ­À´µÄº¯Êý,ÒÔÊÊÓ¦9341µÄ²Ù×÷
//V1.8 20120905
//1,¼ÓÈëLCDÖØÒª²ÎÊýÉèÖÃ½á¹¹Ìålcddev
//2,¼ÓÈëLCD_Display_Dirº¯Êý,Ö§³ÖÔÚÏßºáÊúÆÁÇÐ»»
//V1.9 20120911
//1,ÐÂÔöRM68042Çý¶¯£¨ID:6804£©£¬µ«ÊÇ6804²»Ö§³ÖºáÆÁÏÔÊ¾£¡£¡Ô­Òò£º¸Ä±äÉ¨Ãè·½Ê½£¬
//µ¼ÖÂ6804×ø±êÉèÖÃÊ§Ð§£¬ÊÔ¹ýºÜ¶à·½·¨¶¼²»ÐÐ£¬ÔÝÊ±ÎÞ½â¡£
//V2.0 20120924
//ÔÚ²»Ó²¼þ¸´Î»µÄÇé¿öÏÂ,ILI9341µÄID¶ÁÈ¡»á±»Îó¶Á³É9300,ÐÞ¸ÄLCD_Init,½«ÎÞ·¨Ê¶±ð
//µÄÇé¿ö£¨¶Áµ½IDÎª9300/·Ç·¨ID£©,Ç¿ÖÆÖ¸¶¨Çý¶¯ICÎªILI9341£¬Ö´ÐÐ9341µÄ³õÊ¼»¯¡£
//V2.1 20120930
//ÐÞÕýILI9325¶ÁÑÕÉ«µÄbug¡£
//V2.2 20121007
//ÐÞÕýLCD_Scan_DirµÄbug¡£
//V2.3 20130120
//ÐÂÔö6804Ö§³ÖºáÆÁÏÔÊ¾
//V2.4 20131120
//1,ÐÂÔöNT35310£¨ID:5310£©Çý¶¯Æ÷µÄÖ§³Ö
//2,ÐÂÔöLCD_Set_Windowº¯Êý,ÓÃÓÚÉèÖÃ´°¿Ú,¶Ô¿ìËÙÌî³ä,±È½ÏÓÐÓÃ,µ«ÊÇ¸Ãº¯ÊýÔÚºáÆÁÊ±,²»Ö§³Ö6804.
//V2.5 20140211
//1,ÐÂÔöNT35510£¨ID:5510£©Çý¶¯Æ÷µÄÖ§³Ö
//V2.6 20140504
//1,ÐÂÔöASCII 24*24×ÖÌåµÄÖ§³Ö(¸ü¶à×ÖÌåÓÃ»§¿ÉÒÔ×ÔÐÐÌí¼Ó)  
//2,ÐÞ¸Ä²¿·Öº¯Êý²ÎÊý,ÒÔÖ§³ÖMDK -O2ÓÅ»¯
//3,Õë¶Ô9341/35310/35510,Ð´Ê±¼äÉèÖÃÎª×î¿ì,¾¡¿ÉÄÜµÄÌá¸ßËÙ¶È
//4,È¥µôÁËSSD1289µÄÖ§³Ö,ÒòÎª1289ÊµÔÚÊÇÌ«ÂýÁË,¶ÁÖÜÆÚÒª1us...¼òÖ±ÆæÝâ.²»ÊÊºÏF4Ê¹ÓÃ
//5,ÐÞÕý68042¼°C505µÈICµÄ¶ÁÑÕÉ«º¯ÊýµÄbug.
//V2.7 20140710
//1,ÐÞÕýLCD_Color_Fillº¯ÊýµÄÒ»¸öbug. 
//2,ÐÞÕýLCD_Scan_Dirº¯ÊýµÄÒ»¸öbug.
//V2.8 20140721
//1,½â¾öMDKÊ¹ÓÃ-O2ÓÅ»¯Ê±LCD_ReadPointº¯Êý¶ÁµãÊ§Ð§µÄÎÊÌâ.
//2,ÐÞÕýLCD_Scan_DirºáÆÁÊ±ÉèÖÃµÄÉ¨Ãè·½Ê½ÏÔÊ¾²»È«µÄbug.
//V2.9 20141130
//1,ÐÂÔö¶ÔSSD1963 LCDµÄÖ§³Ö.
//2,ÐÂÔöLCD_SSD_BackLightSetº¯Êý
//3,È¡ÏûILI93XXµÄRxx¼Ä´æÆ÷¶¨Òå
//V3.0 20150423
//ÐÞ¸ÄSSD1963 LCDÆÁµÄÇý¶¯²ÎÊý.
//////////////////////////////////////////////////////////////////////////////////	 

 
 
 
 
 
//LCDµÄ»­±ÊÑÕÉ«ºÍ±³¾°É«	   
u16 POINT_COLOR=0x0000;	//»­±ÊÑÕÉ«
u16 BACK_COLOR=0xFFFF;  //±³¾°É« 

//¹ÜÀíLCDÖØÒª²ÎÊý
//Ä¬ÈÏÎªÊúÆÁ
_lcd_dev lcddev;
	 		

void LCD_Configuration(void)
{
	
	GPIO_InitTypeDef GPIO_InitStructure;
	/* Enable the GPIO_LED Clock */
	RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOC| RCC_APB2Periph_GPIOD|RCC_APB2Periph_GPIOE|RCC_APB2Periph_AFIO , ENABLE); 	
//	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable , ENABLE); //Disable jtag	,Enable SWD
			
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5 |GPIO_Pin_7 |GPIO_Pin_11|GPIO_Pin_12 ;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init(GPIOD, &GPIO_InitStructure);

	GPIO_SetBits(GPIOD, GPIO_Pin_12);  //reset pin
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 ;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init(GPIOC, &GPIO_InitStructure);	
	
	
}

void LCD_Config_DIN(void)
{
	
	GPIO_InitTypeDef GPIO_InitStructure;

			
	GPIO_InitStructure.GPIO_Pin = 0xC703;////GPIO_Pin_14 | GPIO_Pin_15 |GPIO_Pin_1|GPIO_Pin_0|GPIO_Pin_8|GPIO_Pin_9|GPIO_Pin_10 ;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(GPIOD, &GPIO_InitStructure);
	GPIO_ResetBits(GPIOD,0xC703);
	GPIO_InitStructure.GPIO_Pin = 0xff80 ; //PE7-15
	GPIO_Init(GPIOE, &GPIO_InitStructure);	
	GPIO_ResetBits(GPIOE,0xff80);
	
}	

void LCD_Config_DOUT(void)
{
	
	GPIO_InitTypeDef GPIO_InitStructure;

			
	GPIO_InitStructure.GPIO_Pin = 0xC703;////GPIO_Pin_14 | GPIO_Pin_15 |GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_8|GPIO_Pin_9|GPIO_Pin_10 ;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init(GPIOD, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = 0xff80 ; //PE7-15
	GPIO_Init(GPIOE, &GPIO_InitStructure);	
	
	
}	

//PB0~15,×÷ÎªÊý¾ÝÏß
void DATAOUT(u16 x)//Êý¾ÝÊä³ö
{
	LCD_Config_DOUT();
	
	GPIOD->BRR |= (0x03 << 14);  // LCD_D0,D1; PD14,PD15
	GPIOD->BSRR|= ( x & 0x0003) << 14 ;
	
	GPIOD->BRR |= (0x03 << 0);  // LCD_D2,D3; PD0,PD1
	GPIOD->BSRR|= ( x & 0x000c) >> 2 ;
	
	GPIOE->BRR |= (0x1ff << 7);  // LCD_D4-12; PE7-15
	GPIOE->BSRR|= ( x & 0x1ff0) << 3 ;

	GPIOD->BRR |= (0x07 << 8);  // LCD_D13,D14,D15; PD8-10
	GPIOD->BSRR|= ( x & 0xE000) >> 5 ;
	
	
}	


u16 DATAIN()   //Êý¾ÝÊäÈë	
{
		u16 tmp = 0 ;
		LCD_Config_DIN();
		tmp = GPIOD->IDR >> 14; 
		tmp |= ( (GPIOD->IDR & 0x3) << 2);
		tmp |= ((GPIOE->IDR & 0xff80) >> 3);
		tmp |= ((GPIOD->IDR & 0x0700) << 5);
		return tmp;
}



//Ð´¼Ä´æÆ÷º¯Êý
//data:¼Ä´æÆ÷Öµ
void LCD_WR_REG(u16 data)
{ 
	LCD_RS_CLR;//Ð´µØÖ·  
 	LCD_CS_CLR; 
	DATAOUT(data); 
	LCD_WR_CLR; 
	LCD_WR_SET; 
 	LCD_CS_SET;   
}
//Ð´Êý¾Ýº¯Êý
//¿ÉÒÔÌæ´úLCD_WR_DATAXºê,ÄÃÊ±¼ä»»¿Õ¼ä.
//data:¼Ä´æÆ÷Öµ
void LCD_WR_DATAX(u16 data)
{
	LCD_RS_SET;
	LCD_CS_CLR;
	DATAOUT(data);
	LCD_WR_CLR;
	LCD_WR_SET;
	LCD_CS_SET;
}
//¶ÁLCDÊý¾Ý
//·µ»ØÖµ:¶Áµ½µÄÖµ
u16 LCD_RD_DATA(void)
{										   
	u16 t;

	DATAIN();

