studycell/STM32_AIChess/板子代码/AI_Test_Project/Project/EID-V2-all/src/lcd.c
		LCD_WR_REG(0xC8);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x00);

		LCD_WR_REG(0xC9);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x00);

		LCD_WR_REG(0xE0);
		LCD_WR_DATAX(0x16);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x1C);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x21);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x36);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x46);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x52);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x64);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x7A);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x8B);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x99);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xA8);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xB9);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xC4);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xCA);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xD2);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xD9);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xE0);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xF3);
		LCD_WR_DATAX(0x00);

		LCD_WR_REG(0xE1);
		LCD_WR_DATAX(0x16);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x1C);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x22);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x36);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x45);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x52);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x64);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x7A);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x8B);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x99);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xA8);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xB9);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xC4);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xCA);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xD2);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xD8);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xE0);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xF3);
		LCD_WR_DATAX(0x00);

		LCD_WR_REG(0xE2);
		LCD_WR_DATAX(0x05);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x0B);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x1B);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x34);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x44);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x4F);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x61);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x79);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x88);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x97);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xA6);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xB7);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xC2);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xC7);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xD1);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xD6);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xDD);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xF3);
		LCD_WR_DATAX(0x00);
		LCD_WR_REG(0xE3);
		LCD_WR_DATAX(0x05);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xA);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x1C);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x33);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x44);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x50);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x62);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x78);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x88);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x97);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xA6);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xB7);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xC2);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xC7);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xD1);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xD5);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xDD);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xF3);
		LCD_WR_DATAX(0x00);

		LCD_WR_REG(0xE4);
		LCD_WR_DATAX(0x01);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x01);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x02);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x2A);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x3C);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x4B);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x5D);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x74);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x84);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x93);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xA2);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xB3);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xBE);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xC4);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xCD);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xD3);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xDD);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xF3);
		LCD_WR_DATAX(0x00);
		LCD_WR_REG(0xE5);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x02);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x29);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x3C);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x4B);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x5D);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x74);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x84);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x93);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xA2);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xB3);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xBE);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xC4);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xCD);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xD3);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xDC);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xF3);
		LCD_WR_DATAX(0x00);

		LCD_WR_REG(0xE6);
		LCD_WR_DATAX(0x11);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x34);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x56);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x76);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x77);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x66);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x88);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x99);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xBB);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x99);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x66);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x55);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x55);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x45);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x43);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x44);
		LCD_WR_DATAX(0x00);

		LCD_WR_REG(0xE7);
		LCD_WR_DATAX(0x32);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x55);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x76);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x66);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x67);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x67);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x87);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x99);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0xBB);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x99);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x77);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x44);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x56);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x23); 
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x33);
		LCD_WR_DATAX(0x00);
		LCD_WR_DATAX(0x45);
		LCD_WR_DATAX(0x00);

