studycell/STM32_AIChess/板子代码/AI_Test_Project/Project/EID-V2-all/src/lcd.c
		LCD_WR_REG(0xB0);		//ÉèÖÃLCDÄ£Ê½
		LCD_WR_DATA(0x20);		//24Î»Ä£Ê½
		LCD_WR_DATA(0x00);		//TFT Ä£Ê½ 
	
		LCD_WR_DATA((SSD_HOR_RESOLUTION-1)>>8);//ÉèÖÃLCDË®Æ½ÏñËØ
		LCD_WR_DATA(SSD_HOR_RESOLUTION-1);		 
		LCD_WR_DATA((SSD_VER_RESOLUTION-1)>>8);//ÉèÖÃLCD´¹Ö±ÏñËØ
		LCD_WR_DATA(SSD_VER_RESOLUTION-1);		 
		LCD_WR_DATA(0x00);		//RGBÐòÁÐ 
		
		LCD_WR_REG(0xB4);		//Set horizontal period
		LCD_WR_DATA((SSD_HT-1)>>8);
		LCD_WR_DATA(SSD_HT-1);
		LCD_WR_DATA(SSD_HPS>>8);
		LCD_WR_DATA(SSD_HPS);
		LCD_WR_DATA(SSD_HOR_PULSE_WIDTH-1);
		LCD_WR_DATA(0x00);
		LCD_WR_DATA(0x00);
		LCD_WR_DATA(0x00);
		LCD_WR_REG(0xB6);		//Set vertical period
		LCD_WR_DATA((SSD_VT-1)>>8);
		LCD_WR_DATA(SSD_VT-1);
		LCD_WR_DATA(SSD_VPS>>8);
		LCD_WR_DATA(SSD_VPS);
		LCD_WR_DATA(SSD_VER_FRONT_PORCH-1);
		LCD_WR_DATA(0x00);
		LCD_WR_DATA(0x00);
		
		LCD_WR_REG(0xF0);	//ÉèÖÃSSD1963ÓëCPU½Ó¿ÚÎª16bit  
		LCD_WR_DATA(0x03);	//16-bit(565 format) data for 16bpp 

		LCD_WR_REG(0x29);	//¿ªÆôÏÔÊ¾
		//ÉèÖÃPWMÊä³ö  ±³¹âÍ¨¹ýÕ¼¿Õ±È¿Éµ÷ 
		LCD_WR_REG(0xD0);	//ÉèÖÃ×Ô¶¯°×Æ½ºâDBC
		LCD_WR_DATA(0x00);	//disable
	
		LCD_WR_REG(0xBE);	//ÅäÖÃPWMÊä³ö
		LCD_WR_DATA(0x05);	//1ÉèÖÃPWMÆµÂÊ
		LCD_WR_DATA(0xFE);	//2ÉèÖÃPWMÕ¼¿Õ±È
		LCD_WR_DATA(0x01);	//3ÉèÖÃC
		LCD_WR_DATA(0x00);	//4ÉèÖÃD
		LCD_WR_DATA(0x00);	//5ÉèÖÃE 
		LCD_WR_DATA(0x00);	//6ÉèÖÃF 
		
		LCD_WR_REG(0xB8);	//ÉèÖÃGPIOÅäÖÃ
		LCD_WR_DATA(0x03);	//2¸öIO¿ÚÉèÖÃ³ÉÊä³ö
		LCD_WR_DATA(0x01);	//GPIOÊ¹ÓÃÕý³£µÄIO¹¦ÄÜ 
		LCD_WR_REG(0xBA);
		LCD_WR_DATA(0X01);	//GPIO[1:0]=01,¿ØÖÆLCD·½Ïò
		
		LCD_SSD_BackLightSet(100);//±³¹âÉèÖÃÎª×îÁÁ
	}	
	LCD_Display_Dir(0);		 	//Ä¬ÈÏÎªÊúÆÁ
	LCD_LED=1;					//µãÁÁ±³¹â
	LCD_Clear(WHITE);
}  		  
  
//ÇåÆÁº¯Êý
//color:ÒªÇåÆÁµÄÌî³äÉ«
void LCD_Clear(u16 color)
{
	u32 index=0;      
	u32 totalpoint=lcddev.width;
	totalpoint*=lcddev.height; 			//µÃµ½×ÜµãÊý
	if((lcddev.id==0X6804)&&(lcddev.dir==1))//6804ºáÆÁµÄÊ±ºòÌØÊâ´¦Àí  
	{						    
 		lcddev.dir=0;	 
 		lcddev.setxcmd=0X2A;
		lcddev.setycmd=0X2B;  	 			
		LCD_SetCursor(0x00,0x0000);		//ÉèÖÃ¹â±êÎ»ÖÃ  
 		lcddev.dir=1;	 
  		lcddev.setxcmd=0X2B;
		lcddev.setycmd=0X2A;  	 
 	}else LCD_SetCursor(0x00,0x0000);	//ÉèÖÃ¹â±êÎ»ÖÃ 
	LCD_WriteRAM_Prepare();     		//¿ªÊ¼Ð´ÈëGRAM	  	  
	for(index=0;index<totalpoint;index++)LCD_WR_DATA(color);	
}  
//ÔÚÖ¸¶¨ÇøÓòÄÚÌî³äÖ¸¶¨ÑÕÉ«
//ÇøÓò´óÐ¡:(xend-xsta+1)*(yend-ysta+1)
//xsta
//color:ÒªÌî³äµÄÑÕÉ«
void LCD_Fill(u16 sx,u16 sy,u16 ex,u16 ey,u16 color)
{          
	u16 i,j;
	u16 xlen=0;
	u16 temp;
	if((lcddev.id==0X6804)&&(lcddev.dir==1))	//6804ºáÆÁµÄÊ±ºòÌØÊâ´¦Àí  
	{
		temp=sx;
		sx=sy;
		sy=lcddev.width-ex-1;	  
		ex=ey;
		ey=lcddev.width-temp-1;
 		lcddev.dir=0;	 
 		lcddev.setxcmd=0X2A;
		lcddev.setycmd=0X2B;  	 			
		LCD_Fill(sx,sy,ex,ey,color);  
 		lcddev.dir=1;	 
  		lcddev.setxcmd=0X2B;
		lcddev.setycmd=0X2A;  	 
 	}else
	{
		xlen=ex-sx+1;	 
		for(i=sy;i<=ey;i++)
		{
		 	LCD_SetCursor(sx,i);      				//ÉèÖÃ¹â±êÎ»ÖÃ 
			LCD_WriteRAM_Prepare();     			//¿ªÊ¼Ð´ÈëGRAM	  
			for(j=0;j<xlen;j++)LCD_WR_DATA(color);	//ÉèÖÃ¹â±êÎ»ÖÃ 	    
		}
	}
}  
//ÔÚÖ¸¶¨ÇøÓòÄÚÌî³äÖ¸¶¨ÑÕÉ«¿é			 
//(sx,sy),(ex,ey):Ìî³ä¾ØÐÎ¶Ô½Ç×ø±ê,ÇøÓò´óÐ¡Îª:(ex-sx+1)*(ey-sy+1)   
//color:ÒªÌî³äµÄÑÕÉ«
void LCD_Color_Fill(u16 sx,u16 sy,u16 ex,u16 ey,u16 *color)
{  
	u16 height,width;
	u16 i,j;
	width=ex-sx+1; 			//µÃµ½Ìî³äµÄ¿í¶È
	height=ey-sy+1;			//¸ß¶È
 	for(i=0;i<height;i++)
	{
 		LCD_SetCursor(sx,sy+i);   	//ÉèÖÃ¹â±êÎ»ÖÃ 
		LCD_WriteRAM_Prepare();     //¿ªÊ¼Ð´ÈëGRAM
		for(j=0;j<width;j++)LCD_WR_DATA(color[i*width+j]);//Ð´ÈëÊý¾Ý 
	}	  
}

void LCD_ClearFullColor_Circle(int x, int y, int r)
{  
	u16 i,j;
	for(i = x - r; i < x + r; i ++) {
		for(j = y - r; j < y + r; j ++) {
			if((i-x) * (i-x) + (j-y) * (j-y) < r * r && i != x && j != y) {
				LCD_SetCursor(i,j);   	//ÉèÖÃ¹â±êÎ»ÖÃ 
				LCD_WriteRAM_Prepare();     //¿ªÊ¼Ð´ÈëGRAM
				LCD_WR_DATA(YELLOW);//Ð´ÈëÊý¾Ý 
			}
		}
	}
	/*
	for(i = x - r; i <= x + r; i ++) {
		for(j = y - r; j <= y + r; j ++) {
			if((x - i) * (x - i) + (y - j) * (y - j) <= r * r && x != i && y != j) {
				LCD_SetCursor(i, j);
				LCD_WriteRAM_Prepare();
				LCD_WR_DATA(WHITE);
			}
		}
	}
	*/
	if(y == 275) {
			
			for(j = y; j <= y + 15; j ++) {
				LCD_SetCursor(x, j);
				LCD_WriteRAM_Prepare();
				LCD_WR_DATA(YELLOW);
			}
	}
	if(y == 75) {
		  
			for(j = y - 15; j <= y; j ++) {
				LCD_SetCursor(x, j);
			  LCD_WriteRAM_Prepare();
				LCD_WR_DATA(YELLOW);
			} 
	} 
	if(x == 25) {
		  
			for(i = x - 15; i <= x; i ++) {
				LCD_SetCursor(i, y);
			LCD_WriteRAM_Prepare();
				LCD_WR_DATA(YELLOW);
			}
	}
	if(x == 225) {
		  
			for(i = x; i <= x + 15; i ++) {
				LCD_SetCursor(i, y);
			  LCD_WriteRAM_Prepare();
				LCD_WR_DATA(YELLOW);
			}
	}

} 

void LCD_ClearColor_Circle(u16 x,u16 y,u8 r)
{
	u16 i,j;
	for(i = x - r; i < x + r; i ++) {
		for(j = y - r; j < y + r; j ++) {
			if((i-x) * (i-x) + (j-y) * (j-y) < r * r && i != x && j != y) {
				LCD_SetCursor(i,j);   	//ÉèÖÃ¹â±êÎ»ÖÃ 
				LCD_WriteRAM_Prepare();     //¿ªÊ¼Ð´ÈëGRAM
				LCD_WR_DATA(YELLOW);//Ð´ÈëÊý¾Ý 
			}
			else if((i-x) * (i-x) + (j-y) * (j-y) < r * r && (i == x || y == j)) {
				LCD_SetCursor(i,j);   	//ÉèÖÃ¹â±êÎ»ÖÃ 
				LCD_WriteRAM_Prepare();     //¿ªÊ¼Ð´ÈëGRAM
				LCD_WR_DATA(BLACK);//Ð´ÈëÊý¾
		}
		}
	}
	/*
	for(i = x - r; i <= x + r; i ++) {
		for(j = y - r; j <= y + r; j ++) {
			if((x - i) * (x - i) + (y - j) * (y - j) <= r * r && x != i && y != j) {
				LCD_SetCursor(i, j);
				LCD_WriteRAM_Prepare();
				LCD_WR_DATA(WHITE);
			}
		}
	}
	*/
	if(y == 275) {
			
			for(j = y; j <= y + 15; j ++) {
				LCD_SetCursor(x, j);
				LCD_WriteRAM_Prepare();
				LCD_WR_DATA(YELLOW);
			}
	}
	if(y == 75) {
		  
			for(j = y - 15; j <= y; j ++) {
				LCD_SetCursor(x, j);
			  LCD_WriteRAM_Prepare();
				LCD_WR_DATA(YELLOW);
			} 
	} 
	if(x == 25) {
		  
			for(i = x - 15; i <= x; i ++) {
				LCD_SetCursor(i, y);
			LCD_WriteRAM_Prepare();
				LCD_WR_DATA(YELLOW);
			}
	}
	if(x == 225) {
		  
			for(i = x; i <= x + 15; i ++) {
				LCD_SetCursor(i, y);
			  LCD_WriteRAM_Prepare();
				LCD_WR_DATA(YELLOW);
			}
	}
} 								



