studycell/STM32_AIChess/板子代码/AI_Test_Project/Project/EID-V2-all/src/lcd.c
}

#define  TOUCH_READ_TIMES  4
u16 x_addata[TOUCH_READ_TIMES],z_addata[TOUCH_READ_TIMES],y_addata[TOUCH_READ_TIMES];
u32 Temp ,r,sx,sy= 0;
u32 xScreen, yScreen;
#define QPINTERVAL 48
#define QZSIZE 20
#define QPSIZEX 240
#define QPSIZEY 320
#define QPSTARTX 0
#define QPSTARTY 0
#define PROMPTPOSX QPSIZEX/3
#define PROMPTPOSY ((QPSIZEY-QPSIZEY/QPINTERVAL*QPINTERVAL)/2 + QPSIZEY/QPINTERVAL*QPINTERVAL)
#define PROMPTSIZE ((QPSIZEY-QPSIZEY/QPINTERVAL*QPINTERVAL)*2/5)




#define	T_CS_SET  GPIOA->BSRR=1<<15    //Æ¬Ñ¡¶Ë¿Ú  		PA15
#define	T_WR_SET	GPIOB->BSRR=1<<5    //Ð´Êý¾ÝMOSI			PB5
#define	T_SCK_SET	GPIOA->BSRR=1<<5    //SCK			PA5
								    
#define	T_CS_CLR  GPIOA->BRR=1<<15     //Æ¬Ñ¡¶Ë¿Ú  		PA15
#define	T_WR_CLR	GPIOB->BRR=1<<5     //Ð´Êý¾Ý	MOSI		PB5
#define	T_SCK_CLR	GPIOA->BRR=1<<5     //SCK			PA5  

#define	T_IN_STATUE	((GPIOA->IDR & 0X40)?1:0)    //Êý¾ÝMISO PA6	   
 

u8 SPI_SndRecv(u8 data)
{
	u8 tmp=0,i;

	Delay(1);
	for( i = 0 ; i < 8 ; i ++ )
	{
		T_SCK_CLR;

		if(data & 0x80)
			T_WR_SET;
		else
			T_WR_CLR;
		data = data << 1;
		Delay(1);	
		
		T_SCK_SET;
		tmp = tmp << 1;
		tmp |= T_IN_STATUE;		
		Delay(1);

	}

	return tmp ;
	
}


u32 SPI_X(void) { 
   u16		i,j,k;
//     GPIO_ResetBits(GPIOA,GPIO_Pin_15);
	   for(i=0;i<TOUCH_READ_TIMES;i++)					//²ÉÑù4´Î.
	     {
					T_CS_CLR;		//cs
					SPI_SndRecv(0xD0);
					x_addata[i] = SPI_SndRecv(0x00);
				  x_addata[i]<<=8;	
					x_addata[i] |= SPI_SndRecv(0x00);
				  x_addata[i]>>=3;
					T_CS_SET;
			}  
	  for(i=0;i<TOUCH_READ_TIMES;i++)
	    {
    	  for(j=TOUCH_READ_TIMES;j<TOUCH_READ_TIMES-1;j++)
    	    {
             if(x_addata[j] > x_addata[i])
              {
                k = x_addata[i];
                x_addata[i] = x_addata[j];
                x_addata[j] = k;
              }
          }
       }
	 Temp=(x_addata[1] + x_addata[2]) >> 1;
	 r =Temp - 200;
   r *= 240;
   sx=r / (4000 - 200);
   if (sx<=0 || sx>240)
       return 0;
   return sx;
}

u32 SPI_Y(void) { 
	u16 i,j,k;
//	GPIO_ResetBits(GPIOA,GPIO_Pin_15);
	for(i=0;i<TOUCH_READ_TIMES;i++) {					//²ÉÑù4´Î. 
			T_CS_CLR;		//cs
			SPI_SndRecv(0x90);
			y_addata[i] = SPI_SndRecv(0x00);
			y_addata[i]<<=8;	
			y_addata[i] |= SPI_SndRecv(0x00);
			y_addata[i]>>=3;
			T_CS_SET;
	}
	for(i=0;i<TOUCH_READ_TIMES;i++)
	  {
      	for(j=TOUCH_READ_TIMES;j<TOUCH_READ_TIMES-1;j++)
    	  {
             if(y_addata[j] > y_addata[i])
              {
                 k = y_addata[i];
                 y_addata[i] = y_addata[j];
                 y_addata[j] = k;
              }
        }
    }
	Temp=(y_addata[1] + y_addata[2]) >> 1;
	r =Temp - 190;
  r *= 320;
  sy=r / (4000 - 190);
  if (sy<=0 || sy>320)
      return 0;
  return sy;
}  
 
static void TOUCH_INT_config(void) {
     GPIO_InitTypeDef GPIO_InitStructure;
     /* Enable GPIOB, GPIOC and AFIO clock */
     RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC , ENABLE);  
     /* LEDs pins configuration */
     GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
     //GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
     GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
     GPIO_Init(GPIOC, &GPIO_InitStructure);
}

static void TOUCH_INT_EXIT_Init(void) {
     EXTI_InitTypeDef EXTI_InitStructure;
     RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE); //AFIO??
    /* Connect Button EXTI Line to Button GPIO Pin */
     GPIO_EXTILineConfig(GPIO_PortSourceGPIOC,GPIO_PinSource2);
    /* Configure Button EXTI line */
     EXTI_InitStructure.EXTI_Line = EXTI_Line2;
     EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
     EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;  
     EXTI_InitStructure.EXTI_LineCmd = ENABLE;
     EXTI_Init(&EXTI_InitStructure);
	   EXTI_ClearITPendingBit(EXTI_Line2);
	

	}
static void TOUCH_InterruptConfig(void) { 
    NVIC_InitTypeDef NVIC_InitStructure;
  /* Set the Vector Table base address at 0x08000000 */
    NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x0000);
 /* Configure the Priority Group to 2 bits */
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);

    NVIC_InitStructure.NVIC_IRQChannel = EXTI2_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
}

/*static void LCD_BIG_POINT(u16 xScreen, u16 yScreen) {
	;
}*/
static void getPos(u16 xScreen, u16 yScreen) {
	u16 x = xScreen, y = yScreen;
	int i, j;
	int dist = 0;
	for(i = QPSTARTX+QPINTERVAL/2, dist = 9999; i <= QPSTARTX + QPSIZEX; i += QPINTERVAL) {
		if(abs(i-x) <= dist) {
			xScreen = i;
			dist = abs(i-x);
		} 
	}
	for(j = QPSTARTY+QPINTERVAL/2, dist = 9999; j <= QPSTARTY + QPSIZEY; j += QPINTERVAL) {
		if(abs(j-y) <= dist) {
			yScreen = j;
			dist = abs(j-y);
		}
	}
//		play(xScreen/QPINTERVAL, yScreen/QPINTERVAL);
}



void TouchScreen() {
//	static u16 sDataX,sDataY;
	
	xScreen = 240 - SPI_X();
  yScreen = SPI_Y();

	if((xScreen>1)&&(yScreen>1)&&(xScreen<=240)&&(yScreen<=320)) {
		if(!(GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_2)) ) {
			if((xScreen < QPSIZEX/QPINTERVAL*QPINTERVAL-1)&&(yScreen <= QPSIZEY/QPINTERVAL*QPINTERVAL-1)) getPos(xScreen,yScreen);
		}
		//sDataX = xScreen;
		//sDataY = yScreen;
  }
}


int sDataX;
int sDataY;
int dDataX;
int dDataY;
int moveFlag = 0;
int startFlag;
int isAlready;
int times = 0;
void EXTI2_IRQHandler (void) {
	delay_ms(20);
	if(EXTI_GetITStatus(EXTI_Line2) != RESET)
  {
     TouchScreen();
		 if(times == 0 && xScreen != 240) {
				sDataX = xScreen;
			  sDataY = yScreen;
			 //startFlag = 1;
		 }
		 else if(times == 2 && xScreen != 240) {
			 dDataX = xScreen;
			 dDataY = yScreen;
				moveFlag = 1;
		 }
		 times ++;
		 if(times == 4) {
			 times = 0;
		 }
		 
		 startFlag = 1;
		 
  }
	EXTI_ClearITPendingBit(EXTI_Line2);
}

