studycell/STM32_AIChess/板子代码/AI_Test_Project/Project/EID-V2-all/src/lcd.c
int dataX_jiaozhun;
int dataY_jiaozhun;
void jiaozhun(int dataX,int dataY) {
	if(abs(dataX - 25) <= 25) {
		dataX_jiaozhun = 25;
	}
	else if(abs(dataX - 75) <= 25) {
		dataX_jiaozhun = 75;
	}
	else if(abs(dataX - 125) <= 25) {
		dataX_jiaozhun = 125;
	}
	else if(abs(dataX - 175) <= 25) {
		dataX_jiaozhun = 175;
	}
	else if(abs(dataX - 225) <= 25) {
		dataX_jiaozhun = 225;
	}
	
	if(abs(dataY - 75) <= 25) {
		dataY_jiaozhun = 75;
	}
	else if(abs(dataY - 125) <= 25) {
		dataY_jiaozhun = 125;
	}
	else if(abs(dataY - 175) <= 25) {
		dataY_jiaozhun = 175;
	}
	else if(abs(dataY - 225) <= 25) {
		dataY_jiaozhun = 225;
	}
	else if(abs(dataY - 275) <= 25) {
		dataY_jiaozhun = 275;
	}
		
}

int jishu = 0;

//AI:´«4ÖÖºÚ×ÓµÄÏûÏ¢£¬½ÓÊÕ4ÖÖ°××ÓµÄÒÆ¶¯ÏûÏ¢
//vs:±¾»úÅÐ¶Ï
int sDataX_all_BLACK;
int sDataY_all_BLACK;
int dDataX_all_BLACK;
int dDataY_all_BLACK;

extern int sDataX_all_WHITE;
extern int sDataY_all_WHITE;
extern int dDataX_all_WHITE;
extern int dDataY_all_WHITE;
extern int cnt;
extern int recvDealFlag;
extern char recvData;

int clearFlag;
int deleteX;
int deleteY;
int winFlag;
int AI_VS_Flag;


void LCD_test()
{
	 u8 x=0;
	u8 lcd_id[12];			//´æ·ÅLCD ID×Ö·û´®	
  //³õÊ¼»¯ÓëLEDÁ¬½ÓµÄÓ²¼þ½Ó¿Ú
 	LCD_Init();
	POINT_COLOR=BLACK;
	LCD_Clear(RED);
  startFlag = 0;
	LCD_ShowString(30,40,200,24,24,"  vs computer");
	LCD_DrawLine(10,150,225,150);
	LCD_ShowString(30,200,200,24,24,"  vs human");
	while(startFlag == 0) {}
		//times = 0;
		if(sDataY <= 150) {
			AI_VS_Flag = 0;
		}
		else {
			AI_VS_Flag = 1;
		}
	RS232SendByte(AI_VS_Flag);	
		//LCD_ShowString(30,40,200,24,24,"Mini STM32 ^_^");	
	LCD_Clear(YELLOW);
		
		LCD_DrawLine(25,75,25,275);
		LCD_DrawLine(75,75,75,275);
		LCD_DrawLine(125,75,125,275);
		LCD_DrawLine(175,75,175,275);
		LCD_DrawLine(225,75,225,275);
		
		LCD_DrawLine(25,75,225,75);
		LCD_DrawLine(25,125,225,125);
		LCD_DrawLine(25,175,225,175);
		LCD_DrawLine(25,225,225,225);
		LCD_DrawLine(25,275,225,275);
	
		LCD_Draw_Circle_Empty(25,75,15);
		LCD_Draw_Circle_Empty(25,125,15);
		LCD_Draw_Circle_Empty(25,175,15);
		LCD_Draw_Circle_Empty(25,225,15);
		LCD_Draw_Circle_Empty(25,275,15);
		
		LCD_Draw_Circle_Full(225,75,15);
		LCD_Draw_Circle_Full(225,125,15);
		LCD_Draw_Circle_Full(225,175,15);
		LCD_Draw_Circle_Full(225,225,15);
		LCD_Draw_Circle_Full(225,275,15);
		
}

int chess[5][5] = {0};

void Touch_test()
{
	int j;
	TOUCH_SCREEN_INIT();
	TOUCH_INT_config();
	TOUCH_INT_EXIT_Init();
	TOUCH_InterruptConfig();
		LCD_test();
	times = 0;
	
	for(j = 0; j < 5; j ++) {
			chess[0][j] = 1;
      chess[4][j] = 2;
	}
	if(AI_VS_Flag == 0) {
		while(!winFlag) {				//ºóÐøÓ¦¸ÃÉ¾³ýwhile
					jiaozhun(sDataX, sDataY);
					sDataX_all_BLACK = dataX_jiaozhun;
					sDataY_all_BLACK = dataY_jiaozhun;
					sDataX_all_BLACK = LCD_to_USART_X(sDataX_all_BLACK);
					sDataY_all_BLACK = LCD_to_USART_Y(sDataY_all_BLACK);
					if(sDataX_all_BLACK == 5 || sDataY_all_BLACK == 5 || chess[sDataX_all_BLACK][sDataY_all_BLACK] != 1) {
						times = 0;
						moveFlag = 0;
						recvDealFlag = 0;
						continue;
					}
				times = 2;
			if(moveFlag == 1) {
				/*
				jiaozhun(sDataX, sDataY);
				//if(jishu % 2 == 0) {
					//LCD_ClearFullColor_Circle(250 - dataX_jiaozhun, dataY_jiaozhun, 15);
					sDataX_all_BLACK = dataX_jiaozhun;
					sDataY_all_BLACK = dataY_jiaozhun;
					sDataX_all_BLACK = LCD_to_USART_X(sDataX_all_BLACK);
					sDataY_all_BLACK = LCD_to_USART_Y(sDataY_all_BLACK);
					
					if(sDataX_all_BLACK == 5 || sDataY_all_BLACK == 5 || chess[sDataX_all_BLACK][sDataY_all_BLACK] != 1) {
						times = 0;
						moveFlag = 0;
						recvDealFlag = 0;
						continue;
					}
				*/
					jiaozhun(dDataX, dDataY);
					//LCD_Draw_Circle_Full(250 - dataX_jiaozhun, dataY_jiaozhun,15);
					dDataX_all_BLACK = dataX_jiaozhun;
					dDataY_all_BLACK = dataY_jiaozhun;
					
					dDataX_all_BLACK = LCD_to_USART_X(dDataX_all_BLACK);
					dDataY_all_BLACK = LCD_to_USART_Y(dDataY_all_BLACK);
				
				
					if(sDataX_all_BLACK == 5 || sDataY_all_BLACK == 5 || dDataX_all_BLACK == 5 || dDataY_all_BLACK == 5 || chess[sDataX_all_BLACK][sDataY_all_BLACK] != 1 || chess[dDataX_all_BLACK][dDataY_all_BLACK] || abs(sDataX_all_BLACK + sDataY_all_BLACK - dDataX_all_BLACK - dDataY_all_BLACK) != 1 || abs(sDataX_all_BLACK - dDataX_all_BLACK) >= 2 || abs(sDataY_all_BLACK - dDataY_all_BLACK) >= 2) {
						moveFlag = 0;
						recvDealFlag = 0;
						continue;
					}
				chess[sDataX_all_BLACK][sDataY_all_BLACK] = 0;
				chess[dDataX_all_BLACK][dDataY_all_BLACK] = 1;
				sDataX_all_BLACK = USART_to_LCD_X(sDataX_all_BLACK);
					sDataY_all_BLACK = USART_to_LCD_Y(sDataY_all_BLACK);
					dDataX_all_BLACK = USART_to_LCD_X(dDataX_all_BLACK);
					dDataY_all_BLACK = USART_to_LCD_Y(dDataY_all_BLACK);
					LCD_ClearFullColor_Circle(250 - sDataX_all_BLACK, sDataY_all_BLACK, 15);
					LCD_Draw_Circle_Full(250 - dDataX_all_BLACK, dDataY_all_BLACK, 15);
					//LCD_to_USART();
					sDataX_all_BLACK = LCD_to_USART_X(sDataX_all_BLACK);
					sDataY_all_BLACK = LCD_to_USART_Y(sDataY_all_BLACK);
					dDataX_all_BLACK = LCD_to_USART_X(dDataX_all_BLACK);
					dDataY_all_BLACK = LCD_to_USART_Y(dDataY_all_BLACK);
					
					
				//¸Ä³É·¢4´Î
					RS232SendByte(sDataX_all_BLACK);
				while(USART_GetITStatus(USART1, USART_IT_TXE) != RESET) {};
					delay_ms(20);
					RS232SendByte(sDataY_all_BLACK);
					delay_ms(20);
					RS232SendByte(dDataX_all_BLACK);
					delay_ms(20);
					RS232SendByte(dDataY_all_BLACK);
					while(recvDealFlag != 1) {}
					 clearFlag = recvData;
					//clear white
					if(clearFlag == 2) {
						 while(recvDealFlag != 2) {}
						 deleteX = recvData;
						 while(recvDealFlag != 3) {}
						 deleteY = recvData;
						chess[deleteX][deleteY] = 0;
						 deleteX = USART_to_LCD_X(deleteX);
						 deleteY = USART_to_LCD_Y(deleteY);
						 LCD_ClearColor_Circle(250 - deleteX, deleteY, 15);
						 while(recvDealFlag != 4) {}
						 winFlag = recvData;
						 if(winFlag == 2 || winFlag == 1) {
							break;
						 }
					 }
					recvDealFlag = 0;
						 
					while(recvDealFlag != 1) {}
							sDataX_all_WHITE = recvData;
						while(recvDealFlag != 2) {}
							sDataY_all_WHITE = recvData;
						while(recvDealFlag != 3) {}
							dDataX_all_WHITE = recvData;
						while(recvDealFlag != 4) {}
							dDataY_all_WHITE = recvData;
							recvDealFlag = 0;
						chess[sDataX_all_WHITE][sDataY_all_WHITE] = 0;
							chess[dDataX_all_WHITE][dDataY_all_WHITE] = 2;
							
						sDataX_all_WHITE = USART_to_LCD_X(sDataX_all_WHITE);
						sDataY_all_WHITE = USART_to_LCD_Y(sDataY_all_WHITE);
						dDataX_all_WHITE = USART_to_LCD_X(dDataX_all_WHITE);
						dDataY_all_WHITE = USART_to_LCD_Y(dDataY_all_WHITE);
					//}
					LCD_ClearColor_Circle(250 - sDataX_all_WHITE, sDataY_all_WHITE, 15);
					LCD_Draw_Circle_Empty(250 - dDataX_all_WHITE, dDataY_all_WHITE,15);
					while(recvDealFlag != 1) {}
					 clearFlag = recvData;
					//clear black
					if(clearFlag == 1) {
						 while(recvDealFlag != 2) {}
						 deleteX = recvData;
						 while(recvDealFlag != 3) {}
						 deleteY = recvData;
							chess[deleteX][deleteY] = 0;
						 deleteX = USART_to_LCD_X(deleteX);
						 deleteY = USART_to_LCD_Y(deleteY);
						 LCD_ClearFullColor_Circle(250 - deleteX, deleteY, 15);
						 while(recvDealFlag != 4) {}
						 winFlag = recvData;
						if(winFlag == 1 || winFlag == 2) {
							break;
						}
					 }
					recvDealFlag = 0;
					moveFlag = 0;
				}
		}
	}
	else if(AI_VS_Flag == 1) {
		int count = 0;
		int sDataX_all;
		int sDataY_all;
		int dDataX_all;
		int dDataY_all;
		while(!winFlag) {				//ºóÐøÓ¦¸ÃÉ¾³ýwhile
			if(times != 0) {
					jiaozhun(sDataX, sDataY);
					sDataX_all = dataX_jiaozhun;
					sDataY_all = dataY_jiaozhun;
					sDataX_all = LCD_to_USART_X(sDataX_all);
					sDataY_all = LCD_to_USART_Y(sDataY_all);
					if(chess[sDataX_all][sDataY_all] != (count % 2 + 1)) {
						times = 0;
						moveFlag = 0;
						continue;
					}
				}
			if(moveFlag == 1) {								//ºÚÆåÏÈ×ß
					//jiaozhun(sDataX, sDataY);
					//sDataX_all = dataX_jiaozhun;
					//sDataY_all = dataY_jiaozhun;
					jiaozhun(dDataX, dDataY);
					dDataX_all = dataX_jiaozhun;
					dDataY_all = dataY_jiaozhun;
				
					//sDataX_all = LCD_to_USART_X(sDataX_all);
					//sDataY_all = LCD_to_USART_Y(sDataY_all);
					dDataX_all = LCD_to_USART_X(dDataX_all);
					dDataY_all = LCD_to_USART_Y(dDataY_all);
					
