studycell/STM32_AIChess/板子代码/AI_Test_Project/Project/EID-V2-all/src/lcd.c
					if(chess[sDataX_all][sDataY_all] != (count% 2 + 1) || chess[dDataX_all][dDataY_all] || abs(sDataX_all + sDataY_all - dDataX_all - dDataY_all) != 1 || abs(sDataX_all - dDataX_all) >= 2 || abs(sDataY_all - dDataY_all) >= 2) {
					moveFlag = 0;
					recvDealFlag = 0;
					continue;
				}
					
					chess[sDataX_all][sDataY_all] = 0;
					chess[dDataX_all][dDataY_all] = count % 2 + 1;
				
					sDataX_all = USART_to_LCD_X(sDataX_all);
					sDataY_all = USART_to_LCD_Y(sDataY_all);
					dDataX_all = USART_to_LCD_X(dDataX_all);
					dDataY_all = USART_to_LCD_Y(dDataY_all);
				
				if(count % 2 == 0) {
					LCD_ClearFullColor_Circle(250 - sDataX_all, sDataY_all, 15);
					LCD_Draw_Circle_Full(250 - dDataX_all, dDataY_all,15);
				}
				else {
					LCD_ClearColor_Circle(250 - sDataX_all, sDataY_all, 15);
					LCD_Draw_Circle_Empty(250 - dDataX_all, dDataY_all, 15);
				}
					
					
					
					sDataX_all = LCD_to_USART_X(sDataX_all);
					sDataY_all = LCD_to_USART_Y(sDataY_all);
					dDataX_all = LCD_to_USART_X(dDataX_all);
					dDataY_all = LCD_to_USART_Y(dDataY_all);
					
				//¸Ä³É·¢4´Î
					RS232SendByte(sDataX_all);
					delay_ms(20);
					RS232SendByte(sDataY_all);
					delay_ms(20);
					RS232SendByte(dDataX_all);
					delay_ms(20);
					RS232SendByte(dDataY_all);
					while(recvDealFlag != 1) {}
					 clearFlag = recvData;
					//clear white
					if(clearFlag) {
						 while(recvDealFlag != 2) {}
						 deleteX = recvData;
						 while(recvDealFlag != 3) {}
						 deleteY = recvData;
						 
						 if(clearFlag == 2) {
							 chess[deleteX][deleteY] = 0;
							 deleteX = USART_to_LCD_X(deleteX);
						 deleteY = USART_to_LCD_Y(deleteY);
							 LCD_ClearColor_Circle(250 - deleteX, deleteY, 15);
						 }
						else {
							chess[deleteX][deleteY] = 0;
							deleteX = USART_to_LCD_X(deleteX);
						 deleteY = USART_to_LCD_Y(deleteY);
							LCD_ClearFullColor_Circle(250 - deleteX, deleteY, 15);
						}
							while(recvDealFlag != 4) {}
						 winFlag = recvData;
						 if(winFlag) {
							break;
						 }
					 }
					recvDealFlag = 0;
					moveFlag = 0;
					count ++;
				}
			}
		}
	
		LCD_Clear(RED);
		if(winFlag == 1) {
			LCD_ShowString(50,80,200,24,24,"black win");
		}
		else if(winFlag == 2) {
			LCD_ShowString(50,80,200,24,24,"white win");
		}
}



















